Tekla Open API Reference for Tekla Structures 2025
Distance.ToDecimalString Method
Overload List
Name | Description
ToDecimalString()
 Converts the distance to a decimal string representation.
ToDecimalString(IFormatProvider)
 Converts the distance to a decimal string representation.
ToDecimalString(String)
 Converts the distance to a decimal string representation.
ToDecimalString(String, IFormatProvider)
 Converts the distance to a decimal string representation.
ToDecimalString(String, IFormatProvider, Distance.UnitType)
 Converts the distance to a decimal string representation.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace